{"START": 0, "END": 1, "UNK": 2, "PAD": 3, "The": 4, "Vaults": 5, "pub": 6, "near": 7, "Caf\u00e9": 8, "Adriatic": 9, "has": 10, "a": 11, "5": 12, "star": 13, "rating": 14, ".": 15, "Prices": 16, "start": 17, "at": 18, "\u00a3": 19, "30": 20, "\n": 21, "Close": 22, "to": 23, "Brazil": 24, ",": 25, "Cambridge": 26, "Blue": 27, "serves": 28, "delicious": 29, "for": 30, "the": 31, "cheap": 32, "price": 33, "of": 34, "Pub": 35, "food": 36, "Eagle": 37, "is": 38, "low": 39, "rated": 40, "coffee": 41, "shop": 42, "Burger": 43, "King": 44, "and": 45, "riverside": 46, "that": 47, "family": 48, "friendly": 49, "less": 50, "than": 51, "20": 52, "Japanese": 53, "Located": 54, "Sorrento": 55, "French": 56, "eatery": 57, "called": 58, "Mill": 59, "with": 60, "range": 61, "20-": 62, "25": 63, "it": 64, "in": 65, "area": 66, "For": 67, "Loch": 68, "Fyne": 69, "located": 70, "by": 71, "river": 72, "next": 73, "Rice": 74, "Boat": 75, "Bibimbap": 76, "House": 77, "moderately": 78, "priced": 79, "restaurant": 80, "who": 81, "'s": 82, "cuisine": 83, "English": 84, "You": 85, "will": 86, "find": 87, "this": 88, "local": 89, "Clare": 90, "Hall": 91, "Riverside": 92, "an": 93, "adult": 94, "high": 95, "customer": 96, "Wrestlers": 97, "It": 98, "situated": 99, "Raja": 100, "Indian": 101, "Cuisine": 102, "are": 103, "not": 104, "-": 105, "In": 106, "city": 107, "centre": 108, "lies": 109, "Aromi": 110, "adults": 111, "Phoenix": 112, "fast": 113, "place": 114, "They": 115, "have": 116, "moderate": 117, "pricing": 118, "3": 119, "out": 120, "Browns": 121, "Fast": 122, "A": 123, "child": 124, "Taste": 125, "Friendly": 126, "Cocum": 127, "can": 128, "serve": 129, "you": 130, "Italian": 131, "affordable": 132, "prices": 133, "however": 134, "only": 135, "average": 136, "Dumpling": 137, "Tree": 138, "Punter": 139, "provides": 140, "Golden": 141, "Curry": 142, "breakfast": 143, "joint": 144, "Rouge": 145, "offers": 146, "one": 147, "five": 148, "Yippee": 149, "Noodle": 150, "Bar": 151, "Alimentum": 152, "euros": 153, "Chinese": 154, "though": 155, "poor": 156, "Portland": 157, "Arms": 158, "Their": 159, "they": 160, "An": 161, "its": 162, "more": 163, "Near": 164, "All": 165, "One": 166, "Midsummer": 167, "highly": 168, "customers": 169, "but": 170, "close": 171, "Express": 172, "Holiday": 173, "Inn": 174, "Spice": 175, "There": 176, "Strada": 177, "which": 178, "features": 179, "ratings": 180, "Waterman": 181, "serving": 182, "received": 183, "reviews": 184, "providing": 185, "dine": 186, "meals": 187, "named": 188, "Zizzi": 189, "kid": 190, "outside": 191, "City": 192, "Centre": 193, "Bakers": 194, "should": 195, "be": 196, "kids": 197, "Green": 198, "Man": 199, "costs": 200, "thirty": 201, "pounds": 202, "ranging": 203, "non": 204, "Sicilia": 205, "Clowns": 206, "Shop": 207, "fine": 208, "along": 209, "Avalon": 210, "quite": 211, "while": 212, "recommended": 213, "take": 214, "children": 215, "there": 216, "On": 217, "Giraffe": 218, "well": 219, "offering": 220, "higher": 221, "Olive": 222, "Grove": 223, "those": 224, "prepared": 225, "pay": 226, "over": 227, "Six": 228, "Bells": 229, "Twenty": 230, "Two": 231, "Ranch": 232, "Cricketers": 233, "good": 234, "Crowne": 235, "Plaza": 236, "Hotel": 237, "Wildwood": 238, "public": 239, "house": 240, "establishment": 241, "inexpensive": 242, "North": 243, "1": 244, "Rainbow": 245, "Vegetarian": 246, "center": 247, "Palace": 248, "given": 249, "on": 250, "fairly": 251, "excellent": 252, "costing": 253, "atmosphere": 254, "some": 255, "lovely": 256, "stars": 257, "no": 258, "please": 259, "was": 260, "rate": 261, "wine": 262, "cheese": 263, "Its": 264, "yet": 265, "families": 266, "site": 267, "eat": 268, "been": 269, "Children": 270, "served": 271, "Luton": 272, "budget": 273, "spirits": 274, "between": 275, "environment": 276, "With": 277, "as": 278, "traditional": 279, "Plough": 280, "services": 281, "isn": 282, "'": 283, "t": 284, "three": 285, "point": 286, "best": 287, "just": 288, "go": 289, "very": 290, "welcomes": 291, "expensive": 292, "Serving": 293, "Not": 294, "averagely": 295, "north": 296, "British": 297, "Families": 298, "welcome": 299, "Cotto": 300, "This": 301, "because": 302, "mid": 303, "fare": 304, "Customer": 305, "twenty": 306, "pound": 307, "up": 308, "road": 309, "from": 310, "cost": 311, "right": 312, "found": 313, "bar": 314, "conveniently": 315, "town": 316, "style": 317, "If": 318, "'re": 319, "looking": 320, "upscale": 321, "look": 322, "further": 323, "generally": 324, "oriented": 325, "great": 326, "store": 327, "At": 328, "grab": 329, "lunch": 330, "or": 331, "friends": 332, "fair": 333, "items": 334, "starting": 335, "also": 336, "boasts": 337, "being": 338, "allowed": 339, "Fitzbillies": 340, "ranged": 341, "satisfaction": 342, "Rating": 343, "While": 344, "nearby": 345, "hotel": 346, "part": 347, "chain": 348, "end": 349, "Moderately": 350, "standard": 351, "But": 352, "dishes": 353, "offer": 354, "Unfortunately": 355, "permitted": 356, "Travellers": 357, "Rest": 358, "Beefeater": 359, "outskirts": 360, "poorly": 361, "name": 362, "delivers": 363, "away": 364, "does": 365, "sells": 366, "No": 367, "deliveries": 368, "few": 369, "steps": 370, "Highly": 371, "variety": 372, "wines": 373, "cheeses": 374, "enjoy": 375, "sushi": 376, "options": 377, "venue": 378, "visit": 379, "within": 380, "Customers": 381, "reasonably": 382, "get": 383, "when": 384, "off": 385, "allow": 386, "review": 387, "location": 388, "Food": 389, "High": 390, "costumer": 391, "where": 392, "medium": 393, "burger": 394, "gourmet": 395, "Is": 396, "Offering": 397, "locate": 398, "'ll": 399, "whose": 400, "cater": 401, "drinks": 402, "selling": 403, "suitable": 404, "option": 405, "decent": 406, "eating": 407, "burgers": 408, "above": 409, "nice": 410, "try": 411, "Low": 412, "their": 413, "popular": 414, "too": 415, "When": 416, "dining": 417, "beside": 418, "around": 419, "Although": 420, "wide": 421, "fantastic": 422, "service": 423, "young": 424, "Rated": 425, "receives": 426, "edge": 427, "our": 428, "choice": 429, "drink": 430, "all": 431, "under": 432, "foods": 433, "view": 434, "age": 435, "groups": 436, "quality": 437, "quiet": 438, "Welcome": 439, "We": 440, "top": 441, "doesn": 442, "both": 443, "Average": 444, "Ratings": 445, "after": 446, "caters": 447, "lowly": 448, "Priced": 449, "L30": 450, "currently": 451, "pasta": 452, "reasonable": 453, "fresh": 454, "opened": 455, "rates": 456, "menu": 457, "By": 458, "bit": 459, "Kid": 460, "Crown": 461, "considered": 462, "lower": 463, "type": 464, "although": 465, "know": 466, "unfortunately": 467, "middle": 468, "Price": 469, "ranges": 470, "do": 471, "your": 472, "such": 473, "tasty": 474, "hamburgers": 475, "down": 476, "gets": 477, "Eat": 478, "sell": 479, "neat": 480, "welcoming": 481, "outstanding": 482, "love": 483, "somewhere": 484, "I": 485, "about": 486, "pricey": 487, "perfect": 488, "Range": 489, "Find": 490, "cheaply": 491, "terrible": 492, "Check": 493, "light": 494, "meal": 495, "far": 496, "selection": 497, "And": 498, "somewhat": 499, "awesome": 500, "fries": 501, "Along": 502, "so": 503, "specializes": 504, "yes": 505, "level": 506, "whole": 507, "provide": 508, "Looking": 509, "friend": 510, "side": 511, "River": 512, "sit": 513, "unfriendly": 514, "tasting": 515, "value": 516, "got": 517, "featuring": 518, "Adult": 519, "setting": 520, "sits": 521, "scores": 522, "Cheap": 523, "having": 524, "below": 525, "upper": 526, "Asian": 527, "beautiful": 528, "small": 529, "really": 530, "Serves": 531, "Please": 532, "servers": 533, "Yes": 534, "reduced": 535, "consumer": 536, "spot": 537, "American": 538, "dinner": 539, "names": 540, "expect": 541, "Child": 542, "Found": 543, "worth": 544, "Come": 545, "check": 546, "seeking": 547, "greater": 548, "us": 549, "centrally": 550, "most": 551, "stop": 552, "themed": 553, "going": 554, "costly": 555, "facility": 556, "dollars": 557, "bracket": 558, "starred": 559, "plates": 560, "quick": 561, "make": 562, "Join": 563, "available": 564, "However": 565, "want": 566, "..": 567, "Family": 568, "Expect": 569, "gave": 570, "relatively": 571, "loves": 572, "restaurants": 573, "inside": 574, "why": 575, "east": 576, "without": 577, "hors": 578, "d": 579, "due": 580, "Situated": 581, "As": 582, "if": 583, "little": 584, "better": 585, "rage": 586, "specializing": 587, "would": 588, "recommend": 589, "every": 590, "day": 591, "Also": 592, "4": 593, "we": 594, "s": 595, "welcomed": 596, "typical": 597, "heart": 598, "Euros": 599, ";": 600, "cheaper": 601, "mature": 602, "competitive": 603, "Enjoy": 604, "money": 605, "he": 606, "earned": 607, "other": 608, "snacks": 609, "allows": 610, "rank": 611, "new": 612, "views": 613, "come": 614, "typically": 615, "charges": 616, "superb": 617, "across": 618, "home": 619, "Visit": 620, "score": 621, "then": 622, "Meals": 623, "favorite": 624, "comes": 625, "bad": 626, "Our": 627, "none": 628, "give": 629, "towards": 630, "reviewed": 631, "known": 632, "includes": 633, "must": 634, "modest": 635, "Next": 636, "Has": 637, "ideal": 638, "had": 639, "won": 640, "recently": 641, "scored": 642, "ranked": 643, "falls": 644, "Expensive": 645, "Here": 646, "amazing": 647, "places": 648, "banks": 649, "Thames": 650, "seafood": 651, "Area": 652, "Kids": 653, "Start": 654, "provided": 655, "Just": 656, "i": 657, "chips": 658, "including": 659, "per": 660, "head": 661, "yourself": 662, "outlet": 663, "might": 664, "zone": 665, "spend": 666, "like": 667, "Though": 668, "Sushi": 669, "short": 670, "distance": 671, "highest": 672, "takeaway": 673, "experience": 674, "rice": 675, "previous": 676, "selections": 677, "premium": 678, "night": 679, "Go": 680, "Look": 681, "Don": 682, "based": 683, "Three": 684, "makes": 685, "usually": 686, "district": 687, "suited": 688, "L20": 689, "Moderate": 690, "were": 691, "despite": 692, "them": 693, "holds": 694, "proximity": 695, "leave": 696, "placed": 697, "overall": 698, "say": 699, "could": 700, "Down": 701, "licensed": 702, "Try": 703, "tag": 704, "catering": 705, "averaged": 706, "may": 707, ":": 708, "people": 709, "Adults": 710, "eats": 711, "euro": 712, "receiving": 713, "diner": 714, "mind": 715, "buy": 716, "Have": 717, "even": 718, "20.00": 719, "Despite": 720, "styled": 721, "pretty": 722, "offered": 723, "convenient": 724, "sure": 725, "spaghetti": 726, "south": 727, "grub": 728, "riverfront": 729, "taste": 730, "door": 731, "don": 732, "aren": 733, "shops": 734, "bring": 735, "open": 736, "ages": 737, "searching": 738, "wonderful": 739, "sited": 740, "ate": 741, "exclusive": 742, "note": 743, "always": 744, "call": 745, "bill": 746, "among": 747, "many": 748, "free": 749, "ship": 750, "Good": 751, "Leave": 752, "slightly": 753, "plus": 754, "class": 755, "fancy": 756, "fun": 757, "5of5": 758, "rather": 759, "aimed": 760, "authentic": 761, "alcohol": 762, "Wine": 763, "Cheese": 764, "rang": 765, "normal": 766, "here": 767, "what": 768, "Public": 769, "restrooms": 770, "full": 771, "something": 772, "server": 773, "Great": 774, "Conveniently": 775, "need": 776, "corner": 777, "scale": 778, "fruit": 779, "beverages": 780, "person": 781, "regarded": 782, "set": 783, "Locate": 784, "E20": 785, "averages": 786, "gives": 787, "Bring": 788, "bite": 789, "ok": 790, "margin": 791, "now": 792, "amenities": 793, "Even": 794, "clentele": 795, "Only": 796, "mediocre": 797, "averaging": 798, "GBP": 799, "alternative": 800, "much": 801, "Star": 802, "Right": 803, "deals": 804, "okay": 805, "aware": 806, "still": 807, "Mid": 808, "entire": 809, "everyone": 810, "order": 811, "list": 812, "College": 813, "oriental": 814, "classic": 815, "into": 816, "starts": 817, "see": 818, "bank": 819, "products": 820}